Ruby-Programs/blog/app/controllers/comments_controller.rb

  def create
    @post = Post.find(params[:post_id])
    @comment = @post.comments.create(comment_params)
---
SELECT "posts".* FROM "posts" WHERE "posts"."id" = $1 LIMIT $2  [["id", 9], ["LIMIT", 1]]
INSERT INTO "comments" ("name", "body", "created_at", "updated_at", "post_id") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["name", ""], ["body", ""], ["created_at", "2021-09-06 14:38:44.667340"], ["updated_at", "2021-09-06 14:38:44.667340"], ["post_id", 9]]