Ruby-Programs/blog/app/views/posts/index.html.erb

		    <div class="comment-count">
		    	<span class="tag is-rounded"><%= post.comments.count %> comments</span>
---
SELECT COUNT(*) FROM "comments" WHERE "comments"."post_id" = $1  [["post_id", 11]]