Ruby-Programs/blog/app/views/posts/show.html.erb

	<div class="container">
		<h2 class="subtitle is-5"><strong><%= @post.comments.count %></strong> Comments</h2>
---
SELECT "comments".* FROM "comments" WHERE "comments"."post_id" = $1  [["post_id", 7]]
SELECT COUNT(*) FROM "comments" WHERE "comments"."post_id" = $1  [["post_id", 7]]